[

  {
    "id":846129,
    "title": "Windows install on GPT with multiple drives",
    "body":"<p>I've got quite an interesting system configuration here, and I would like to install Windows 10 preview on it. I have 3 drives, out of which one is a SSD. They all have a GPT table.</p>\n\n<ul>\n<li><strong>Drive 0</strong> (the ssd) has the following partitions on it:\n<ul>\n<li>EFI SYSTEM PARTITION (fat32)</li>\n<li>Linux '/' (ext4)</li>\n<li>Linux '/home' (ext4)</li>\n</ul></li>\n<li><strong>Drive 1</strong> is fully dedicated to data.\n<ul>\n<li>LVM2 Physical Volume</li>\n</ul></li>\n<li><strong>Drive 2</strong> is the drive I want to install windows to.\n<ul>\n<li>LVM2 Physical Volume</li>\n<li>Empty space (for windows)</li>\n</ul></li>\n</ul>\n\n<p>After I boot the installer in UEFI mode, I select the 'Drive 2 Unallocated space' entry. It returns an error message:</p>\n\n<blockquote>\n  <p>Your EFI system partition is formatted as NTFS. It needs to be formatted as FAT32. Please reformat your EFI partition and then try again. No changes to your computer will be saved.</p>\n</blockquote>\n\n<p>There are 2 interesting things about that message, the first one is that after I rebooted to Linux, the partitions Windows has created were still there, therefore changes to my computer apparently were saved. Here is a screenshot of GParted showing the resulting configuration.</p>\n\n<p><a href=\"http://dl.dropbox.com/u/5011799/-dev-sdc%20-%20GParted_010.png\" rel=\"nofollow\">http://dl.dropbox.com/u/5011799/-dev-sdc%20-%20GParted_010.png</a></p>\n\n<p>The other thing is, that one of the partitions Windows created was an EFI FAT32. My suspicion is that the installer did not see - from whatever reason - my already existing partition on <strong>Drive 0</strong> and attempted to create a new one. However, since a partition already existed on <strong>Drive 2</strong> and I think the installer later looks for the EFI partition using just the index number on the drive, it found a different partition which was - in this case - formatted as NTFS, hence giving me the error message.</p>\n\n<p>I tried one other things, and that was installing on a GPT drive with no partitions at all. What surprised me is that the installation failed too, with the following message:</p>\n\n<blockquote>\n  <p>Windows could not prepare your computer to boot into the next stage of the installation. To install Windows, please restart the installation. No changes to your computer will be saved.</p>\n</blockquote>\n\n<p>As the error suggests, I restarted the installation (again finding the four partitions the installer has created regardless of the message) and it failed in the exact same way again. My only idea was that it had something to do with my other drives, so I pulled all of them out but it failed yet again. (Same error message as last time). I have no clue what is going on here.</p>\n\n<p>I am now going to try installing Windows 8.1 and will report back shortly.</p>\n\n<p>Any help or ideas are appreciated.</p>\n\n<p><strong>EDIT:</strong> Windows 8.1 also gave me the 'formatted as ntfs' error when installing to the drive with an existing partition, and I currently don't have access to an empty hard drive.</p>\n"

  },


  {
    "id": 695685,
    "title": "Can an SSL cert (not self-signed) be used to create another SSL cert for another host in the same domain?",
    "body":"<p>I have a regular SSL certificate issued by Network Solutions for a given host, say \"host A\". Can I create another SSL cert for the wiki host that has the host A cert in its trust path and therefore works for use on the wiki host? Both hosts are in the same domain, for example:</p>\n\n<p>a.host.com &lt;- host A uses purchased SSL cert; CA is Network Solutions</p>\n\n<p>wiki.host.com &lt;- needs its own cert</p>\n\n<p>This question is based on my assumption that since I own a trusted cert from a trusted CA for my domain, then I should be able to use that cert to make others for other hosts on the same domain and those new certs should be trusted since they record the \"trust path\" up to a trusted CA.</p>\n"
  },


  {
    "id":222060,
    "title": "Monitor Troubles",
    "body":"<p>Let me start with telling you my machine.</p>\n\n<p>Win 7 pro. dual monitor extended displays. main is 1680x1050 and secondary is 1280x1024. Both monitores are LCD.</p>\n\n<p>Both monitors are over 2-3 years old.</p>\n\n<p>Here is the problem:</p>\n\n<p>Recently when i boot my computer the main monitor will briefly turn on and then turn off and NOT turn on again unless i do numerous things to it until it comes back on. The secondary monitor functions correctly. I was wondering if there was anything that i could do to save the monitor?</p>\n\n<p>To fix the issue i usually unplug the monitor for a few seconds and plug back in, or turn it on and off, or restart the computer. It will also not come back on after the computer has went to sleep.</p>\n\n<p>Once it is on it usually stays on until the computer turns the screen off... i have not experienced it turning off while in use.</p>\n\n<p>Thanks</p>\n\n<p><strong>New information regarding my problem:</strong></p>\n\n<p>It happened again last night. So i tried the normal things to get it to turn on that i listed above. This time it would not turn on. I got new cables and tried that and it did not fix the problem. After some time swapping cables, turning it on and off again, unplugging it for a few seconds plugging back in, restarting computer... it finally decided to turn on and stay on for the rest of the evening. Does anyone else have any suggestions on what i might can do to fix the monitor? It is a really nice and large monitor and would hate to have to buy a new one... monitors are expensive.</p>\n\n<p>Thanks</p>\n"
  }


]